routes/web.php

});

Route::get('/jobs', function () {
    $jobs = Job::with('employer')->simplePaginate(3);
---
select * from "employers" where "employers"."id" in (1, 2, 3)